name: "TextNet"
layer {
  name: "text_data"
  type: "HDF5Data"
  top: "tlabelv"
  top: "tdata"
  top: "tlabel"
  include {
    phase: TRAIN
  }
  hdf5_data_param {
    source: "/home/ruoyu/Crossmedia(deep)/Benchmarks/pascal_sentence/3/txt_h5_list_tr.txt"
    batch_size: 256
  }
}
layer {
  name: "text_data"
  type: "HDF5Data"
  top: "tlabelv"
  top: "tdata"
  top: "tlabel"
  include {
    phase: TEST
  }
  hdf5_data_param {
    source: "/home/ruoyu/Crossmedia(deep)/Benchmarks/pascal_sentence/3/txt_h5_list_te.txt"
    batch_size: 64
  }
}
layer {
  name: "silence"
  type: "Silence"
  bottom: "tlabel"
  include {
    phase: TRAIN
  }
}
layer {
  name: "silence1"
  type: "Silence"
  bottom: "tlabelv"
  include {
    phase: TEST
  }
}
layer {
  name: "fc1"
  type: "InnerProduct"
  bottom: "tdata"
  top: "fc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn1"
  type: "BatchNorm"
  bottom: "fc1"
  top: "fc1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "fc1"
  top: "fc1"
}
layer {
  name: "drop1"
  type: "Dropout"
  bottom: "fc1"
  top: "fc1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc2"
  type: "InnerProduct"
  bottom: "fc1"
  top: "fc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2"
  type: "BatchNorm"
  bottom: "fc2"
  top: "fc2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "fc2"
  top: "fc2"
}
layer {
  name: "drop2"
  type: "Dropout"
  bottom: "fc2"
  top: "fc2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc3"
  type: "InnerProduct"
  bottom: "fc2"
  top: "fc3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "softmax"
  type: "Softmax"
  bottom: "fc3"
  top: "fc3"
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc3"
  bottom: "tlabel"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "fc3"
  bottom: "tlabelv"
  top: "loss"
  include {
    phase: TRAIN
  }
}